namespace R440O.Parameters
{
    internal class PU_K1_2Parameters
    {
        ////Лампочки
        public static bool PU_K1_2ЛампочкаCеть;

        ////Тумблеры 
        /// <summary>
        /// Возможные состояния: 0. Дист - дистанционное управление, 1. Откл - отключено, 2. Мест - местное управление.
        /// </summary>
        public static int PU_K1_2ТумблерПитание
        {
            get { return _pU_K1_2ТумблерПитание; }

            set
            {
                if (value >= 0 && value <= 2)
                {
                    _pU_K1_2ТумблерПитание = value;
                }
            }
        }
        private static int _pU_K1_2ТумблерПитание = 1;

        public static bool PU_K1_2ТумблерВентВкл = false;

        #region Переключатели
        /// <summary>
        /// Положение переключателя контроля
        /// </summary>
        private static int _pU_K1_2ПереключательКаналы = 1;

        public static int PU_K1_2ПереключательКаналы
        {
            get
            {
                return _pU_K1_2ПереключательКаналы;
            }

            set
            {
                if (value > 0 && value < 5)
                {
                    _pU_K1_2ПереключательКаналы = value;
                }
            }
        }

        /// <summary>
        /// Названия положений переключателя контроля. Второй столбец - комплект включён. Третий - комплект выключен.
        /// </summary>
        public static string[,] PU_K1_2ЗначенияПереключательКаналы = { 
            { "ПРМ 1", "0" },
            { "ПРМ 2", "0" },
            { "ПРД 1", "0" },
            { "ПРД 2", "0" }
        };

        /// <summary>
        /// Положение переключателя контроля
        /// </summary>
        private static int _pU_K1_2ПереключательНапряжение = 1;

        public static int PU_K1_2ПереключательНапряжение
        {
            get
            {
                return _pU_K1_2ПереключательНапряжение;
            }

            set
            {
                if (value > 0 && value < 13)
                {
                    _pU_K1_2ПереключательНапряжение = value;
                }
            }
        }

        /// <summary>
        /// Названия положений переключателя контроля. Второй столбец - комплект включён. Третий - комплект выключен.
        /// </summary>
        public static string[,] PU_K1_2ЗначенияПереключательНапряжение = { 
            { "-27", "0" },
            { "-12,6", "0" },
            { "-5", "0" },
            { "+5", "0" },
            { "+6", "0" },
            { "+12,6 I", "0" },
            { "+12,6 III", "0" },
            { "+23 I", "0" },
            { "+23 II", "0" },
            { "+60 I", "0" },
            { "+60 II", "0" },
            { "+120", "0" }
        };
        #endregion
    }
}
